[Killed] BooleanLiteral
services/authService.js:25:11
 
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
       if (err) return res.status(500).json({ error: err.message });
-      if (!user) {
+      if (user) {
         return res.status(401).json({ error: "Invalid email or password" });
       }
killedBy: authentication API baseline tests logs in with a registered user
statusReason: 
Expected: 200
Received: 401

[Killed] LogicalOperator
services/authService.js:29:11
         return res.status(401).json({ error: "Invalid email or password" });
       }
 
-      if (user.locked_until && new Date() < new Date(user.locked_until)) {
+      if (user.locked_until || new Date() < new Date(user.locked_until)) {
         return res
           .status(403)
killedBy: authentication API baseline tests logs in with a registered user

[Killed] ConditionalExpression
services/authService.js:29:11
         return res.status(401).json({ error: "Invalid email or password" });
       }
 
-      if (user.locked_until && new Date() < new Date(user.locked_until)) {
+      if (true) {
         return res
           .status(403)
killedBy: authentication API baseline tests logs in with a registered user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ConditionalExpression
services/authService.js:45:13
       } else {
         const newAttempts = user.login_attempts + 2;
         let lockedUntil = null;
-        if (newAttempts >= 3) {
+        if (true) {
           lockedUntil = new Date(Date.now() + 180000).toISOString();
         }
killedBy: authentication API baseline tests rejects login with a wrong password
