[Killed] ConditionalExpression
business/orderLogic.js:2:7
 function calculateOrderSummary(cartItems, options = {}) {
-  if (!Array.isArray(cartItems) || cartItems.length === 0) {
+  if (false) {
     throw new Error("Cart must contain at least one item");
   }
killedBy: order checkout business logic rejects empty carts
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cart must contain at least one item"

Received function did not throw

[Killed] LogicalOperator
business/orderLogic.js:2:7
 function calculateOrderSummary(cartItems, options = {}) {
-  if (!Array.isArray(cartItems) || cartItems.length === 0) {
+  if (!Array.isArray(cartItems) && cartItems.length === 0) {
     throw new Error("Cart must contain at least one item");
   }
killedBy: order checkout business logic rejects empty carts
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cart must contain at least one item"

Received function did not throw

[Killed] BlockStatement
business/orderLogic.js:6:52
     throw new Error("Cart must contain at least one item");
   }
 
-  const subtotal = cartItems.reduce((sum, item) => {
-    if (!item || item.quantity <= 0) {
-      throw new Error("Item quantity must be greater than zero");
-    }
-    if (item.price < 0) {
-      throw new Error("Item price cannot be negative");
-    }
-    return sum + item.price * item.quantity;
-  }, 0);
+  const subtotal = cartItems.reduce((sum, item) => {}, 0);
 
   const discount = calculateDiscount(subtotal, options.couponCode);
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "discount": 0,
    "shippingFee": 30000,

[Killed] ConditionalExpression
business/orderLogic.js:7:18
   }
 
   const subtotal = cartItems.reduce((sum, item) => {
-    if (!item || item.quantity <= 0) {
+    if (!item || false) {
       throw new Error("Item quantity must be greater than zero");
     }
killedBy: order checkout business logic rejects invalid quantity
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Item quantity must be greater than zero"

Received function did not throw

[Killed] EqualityOperator
business/orderLogic.js:7:18
   }
 
   const subtotal = cartItems.reduce((sum, item) => {
-    if (!item || item.quantity <= 0) {
+    if (!item || item.quantity > 0) {
       throw new Error("Item quantity must be greater than zero");
     }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: Item quantity must be greater than zero

[Killed] StringLiteral
business/orderLogic.js:8:23
 
   const subtotal = cartItems.reduce((sum, item) => {
     if (!item || item.quantity <= 0) {
-      throw new Error("Item quantity must be greater than zero");
+      throw new Error("");
     }
     if (item.price < 0) {
killedBy: order checkout business logic rejects invalid quantity
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Item quantity must be greater than zero"
Received message:   ""

      69 |           } else {
      70 |             stryCov_9fa48("17");
    > 71 |             throw new Error(stryMutAct_9fa48("18") ? "" : (stryCov_9fa48("18"), "Item quantity must be greater than zero"));

[Killed] ConditionalExpression
business/orderLogic.js:10:9
     if (!item || item.quantity <= 0) {
       throw new Error("Item quantity must be greater than zero");
     }
-    if (item.price < 0) {
+    if (true) {
       throw new Error("Item price cannot be negative");
     }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: Item price cannot be negative

[Killed] EqualityOperator
business/orderLogic.js:10:9
     if (!item || item.quantity <= 0) {
       throw new Error("Item quantity must be greater than zero");
     }
-    if (item.price < 0) {
+    if (item.price >= 0) {
       throw new Error("Item price cannot be negative");
     }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: Item price cannot be negative

[Killed] ArithmeticOperator
business/orderLogic.js:13:18
     if (item.price < 0) {
       throw new Error("Item price cannot be negative");
     }
-    return sum + item.price * item.quantity;
+    return sum + item.price / item.quantity;
   }, 0);
 
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "discount": 0,
    "shippingFee": 30000,

[Killed] ArithmeticOperator
business/orderLogic.js:13:12
     if (item.price < 0) {
       throw new Error("Item price cannot be negative");
     }
-    return sum + item.price * item.quantity;
+    return sum - item.price * item.quantity;
   }, 0);
 
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "discount": 0,
    "shippingFee": 30000,

[Killed] ArithmeticOperator
business/orderLogic.js:18:34
 
   const discount = calculateDiscount(subtotal, options.couponCode);
   const shippingFee = calculateShippingFee(subtotal, options.shippingMethod);
-  const taxableAmount = Math.max(subtotal - discount, 0);
+  const taxableAmount = Math.max(subtotal + discount, 0);
   const tax = roundMoney(taxableAmount * 0.08);
   const total = roundMoney(taxableAmount + shippingFee + tax);
killedBy: order checkout business logic applies SAVE10 coupon before tax
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 418800
Received: 505200

[Killed] MethodExpression
business/orderLogic.js:18:25
 
   const discount = calculateDiscount(subtotal, options.couponCode);
   const shippingFee = calculateShippingFee(subtotal, options.shippingMethod);
-  const taxableAmount = Math.max(subtotal - discount, 0);
+  const taxableAmount = Math.min(subtotal - discount, 0);
   const tax = roundMoney(taxableAmount * 0.08);
   const total = roundMoney(taxableAmount + shippingFee + tax);
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discount": 0,
    "shippingFee": 30000,

[Killed] ArithmeticOperator
business/orderLogic.js:19:26
   const discount = calculateDiscount(subtotal, options.couponCode);
   const shippingFee = calculateShippingFee(subtotal, options.shippingMethod);
   const taxableAmount = Math.max(subtotal - discount, 0);
-  const tax = roundMoney(taxableAmount * 0.08);
+  const tax = roundMoney(taxableAmount / 0.08);
   const total = roundMoney(taxableAmount + shippingFee + tax);
 
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discount": 0,
    "shippingFee": 30000,

[Killed] ArithmeticOperator
business/orderLogic.js:20:28
   const shippingFee = calculateShippingFee(subtotal, options.shippingMethod);
   const taxableAmount = Math.max(subtotal - discount, 0);
   const tax = roundMoney(taxableAmount * 0.08);
-  const total = roundMoney(taxableAmount + shippingFee + tax);
+  const total = roundMoney(taxableAmount - shippingFee + tax);
 
   return {
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "discount": 0,
    "shippingFee": 30000,

[Killed] ArithmeticOperator
business/orderLogic.js:20:28
   const shippingFee = calculateShippingFee(subtotal, options.shippingMethod);
   const taxableAmount = Math.max(subtotal - discount, 0);
   const tax = roundMoney(taxableAmount * 0.08);
-  const total = roundMoney(taxableAmount + shippingFee + tax);
+  const total = roundMoney(taxableAmount + shippingFee - tax);
 
   return {
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "discount": 0,
    "shippingFee": 30000,

[Killed] ObjectLiteral
business/orderLogic.js:22:10
   const tax = roundMoney(taxableAmount * 0.08);
   const total = roundMoney(taxableAmount + shippingFee + tax);
 
-  return {
-    subtotal: roundMoney(subtotal),
-    discount,
-    shippingFee,
-    tax,
-    total,
-  };
+  return {};
 }
 
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "discount": 0,
-   "shippingFee": 30000,

[Killed] BlockStatement
business/orderLogic.js:31:50
   };
 }
 
-function calculateDiscount(subtotal, couponCode) {
-  if (couponCode === "SAVE10") {
-    return roundMoney(subtotal * 0.1);
-  }
-  if (couponCode === "FREESHIP" || !couponCode) {
-    return 0;
-  }
-  return 0;
-}
+function calculateDiscount(subtotal, couponCode) {}
 
 function calculateShippingFee(subtotal, shippingMethod = "standard") {
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "discount": 0,
+   "discount": undefined,

[Killed] ConditionalExpression
business/orderLogic.js:32:7
 }
 
 function calculateDiscount(subtotal, couponCode) {
-  if (couponCode === "SAVE10") {
+  if (false) {
     return roundMoney(subtotal * 0.1);
   }
killedBy: order checkout business logic applies SAVE10 coupon before tax
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40000
Received: 0

[Killed] EqualityOperator
business/orderLogic.js:32:7
 }
 
 function calculateDiscount(subtotal, couponCode) {
-  if (couponCode === "SAVE10") {
+  if (couponCode !== "SAVE10") {
     return roundMoney(subtotal * 0.1);
   }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "discount": 0,
+   "discount": 25000,

[Killed] ArithmeticOperator
business/orderLogic.js:33:23
 
 function calculateDiscount(subtotal, couponCode) {
   if (couponCode === "SAVE10") {
-    return roundMoney(subtotal * 0.1);
+    return roundMoney(subtotal / 0.1);
   }
   if (couponCode === "FREESHIP" || !couponCode) {
killedBy: order checkout business logic applies SAVE10 coupon before tax
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40000
Received: 4000000

[Survived] ConditionalExpression
business/orderLogic.js:35:7
   if (couponCode === "SAVE10") {
     return roundMoney(subtotal * 0.1);
   }
-  if (couponCode === "FREESHIP" || !couponCode) {
+  if (true) {
     return 0;
   }

[Survived] ConditionalExpression
business/orderLogic.js:35:7
   if (couponCode === "SAVE10") {
     return roundMoney(subtotal * 0.1);
   }
-  if (couponCode === "FREESHIP" || !couponCode) {
+  if (false) {
     return 0;
   }

[Killed] BlockStatement
business/orderLogic.js:41:70
   return 0;
 }
 
-function calculateShippingFee(subtotal, shippingMethod = "standard") {
-  if (shippingMethod === "express") {
-    return 45000;
-  }
-  if (subtotal >= 500000) {
-    return 0;
-  }
-  return 30000;
-}
+function calculateShippingFee(subtotal, shippingMethod = "standard") {}
 
 function roundMoney(value) {
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discount": 0,
-   "shippingFee": 30000,

[Survived] StringLiteral
business/orderLogic.js:41:58
   return 0;
 }
 
-function calculateShippingFee(subtotal, shippingMethod = "standard") {
+function calculateShippingFee(subtotal, shippingMethod = "") {
   if (shippingMethod === "express") {
     return 45000;

[Killed] EqualityOperator
business/orderLogic.js:42:7
 }
 
 function calculateShippingFee(subtotal, shippingMethod = "standard") {
-  if (shippingMethod === "express") {
+  if (shippingMethod !== "express") {
     return 45000;
   }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discount": 0,
-   "shippingFee": 30000,

[Killed] ConditionalExpression
business/orderLogic.js:42:7
 }
 
 function calculateShippingFee(subtotal, shippingMethod = "standard") {
-  if (shippingMethod === "express") {
+  if (true) {
     return 45000;
   }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discount": 0,
-   "shippingFee": 30000,

[Killed] EqualityOperator
business/orderLogic.js:45:7
   if (shippingMethod === "express") {
     return 45000;
   }
-  if (subtotal >= 500000) {
+  if (subtotal < 500000) {
     return 0;
   }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discount": 0,
-   "shippingFee": 30000,

[Killed] ConditionalExpression
business/orderLogic.js:45:7
   if (shippingMethod === "express") {
     return 45000;
   }
-  if (subtotal >= 500000) {
+  if (true) {
     return 0;
   }
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discount": 0,
-   "shippingFee": 30000,

[Killed] BlockStatement
business/orderLogic.js:51:28
   return 30000;
 }
 
-function roundMoney(value) {
-  return Math.round(value);
-}
+function roundMoney(value) {}
 
 module.exports = {
killedBy: order checkout business logic calculates subtotal, tax, shipping and total for a normal order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "discount": 0,
    "shippingFee": 30000,
