[Killed] StringLiteral
services/authService.js:49:11
           lockedUntil = new Date(Date.now() + 180000).toISOString();
         }
         db.run(
-          "UPDATE users SET login_attempts = ?, locked_until = ? WHERE id = ?",
+          "",
           [newAttempts, lockedUntil, user.id],
         );
killedBy: authentication API baseline tests rejects login with a wrong password
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
