[Survived] ArrayDeclaration
services/orderService.js:18:49
 function addToCart(db, userCarts) {
   return (req, res) => {
     const userId = req.user.id;
-    if (!userCarts[userId]) userCarts[userId] = [];
+    if (!userCarts[userId]) userCarts[userId] = ["Stryker was here"];
     userCarts[userId].push(req.body);
     res.json({ message: "Added to cart" });

[Survived] ConditionalExpression
services/orderService.js:47:18
       [req.user.id],
       (err, orders) => {
         if (err) return res.status(500).json({ error: err.message });
-        res.json(orders || []);
+        res.json(false);
       },
     );
