[Killed] BlockStatement
services/orderService.js:8:24
  */
 
 function getCart(db, userCarts) {
-  return (req, res) => {
-    const userId = req.user.id;
-    if (!userCarts[userId]) userCarts[userId] = [];
-    res.json(userCarts[userId]);
-  };
+  return (req, res) => {};
 }
 
killedBy: order API baseline tests reads an empty cart and adds an item
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
services/orderService.js:10:9
 function getCart(db, userCarts) {
   return (req, res) => {
     const userId = req.user.id;
-    if (!userCarts[userId]) userCarts[userId] = [];
+    if (userCarts[userId]) userCarts[userId] = [];
     res.json(userCarts[userId]);
   };
killedBy: order API baseline tests reads an empty cart and adds an item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: ""

[Killed] ConditionalExpression
services/orderService.js:10:9
 function getCart(db, userCarts) {
   return (req, res) => {
     const userId = req.user.id;
-    if (!userCarts[userId]) userCarts[userId] = [];
+    if (false) userCarts[userId] = [];
     res.json(userCarts[userId]);
   };
killedBy: order API baseline tests reads an empty cart and adds an item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: ""

[Killed] BlockStatement
services/orderService.js:16:24
 }
 
 function addToCart(db, userCarts) {
-  return (req, res) => {
-    const userId = req.user.id;
-    if (!userCarts[userId]) userCarts[userId] = [];
-    userCarts[userId].push(req.body);
-    res.json({ message: "Added to cart" });
-  };
+  return (req, res) => {};
 }
 
killedBy: order API baseline tests reads an empty cart and adds an item
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
services/orderService.js:18:9
 function addToCart(db, userCarts) {
   return (req, res) => {
     const userId = req.user.id;
-    if (!userCarts[userId]) userCarts[userId] = [];
+    if (true) userCarts[userId] = [];
     userCarts[userId].push(req.body);
     res.json({ message: "Added to cart" });

[Killed] BlockStatement
services/orderService.js:25:24
 }
 
 function checkout(db, userCarts) {
-  return (req, res) => {
-    const userId = req.user.id;
-    const { total_amount, shipping_address } = req.body;
-
-    db.run(
-      "INSERT INTO orders (user_id, total_amount, status, shipping_address) VALUES (?, ?, ?, ?)",
-      [userId, total_amount, "pending", shipping_address],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Checkout successful", orderId: this.lastID });
-      },
-    );
-  };
+  return (req, res) => {};
 }
 
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrayDeclaration
services/orderService.js:31:7
 
     db.run(
       "INSERT INTO orders (user_id, total_amount, status, shipping_address) VALUES (?, ?, ?, ?)",
-      [userId, total_amount, "pending", shipping_address],
+      [],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
services/orderService.js:32:22
     db.run(
       "INSERT INTO orders (user_id, total_amount, status, shipping_address) VALUES (?, ?, ?, ?)",
       [userId, total_amount, "pending", shipping_address],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Checkout successful", orderId: this.lastID });
-      },
+      function (err) {},
     );
   };
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
services/orderService.js:33:13
       "INSERT INTO orders (user_id, total_amount, status, shipping_address) VALUES (?, ?, ?, ?)",
       [userId, total_amount, "pending", shipping_address],
       function (err) {
-        if (err) return res.status(500).json({ error: err.message });
+        if (true) return res.status(500).json({ error: err.message });
         res.json({ message: "Checkout successful", orderId: this.lastID });
       },
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ConditionalExpression
services/orderService.js:33:13
       "INSERT INTO orders (user_id, total_amount, status, shipping_address) VALUES (?, ?, ?, ?)",
       [userId, total_amount, "pending", shipping_address],
       function (err) {
-        if (err) return res.status(500).json({ error: err.message });
+        if (false) return res.status(500).json({ error: err.message });
         res.json({ message: "Checkout successful", orderId: this.lastID });
       },

[Killed] ObjectLiteral
services/orderService.js:34:18
       [userId, total_amount, "pending", shipping_address],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Checkout successful", orderId: this.lastID });
+        res.json({});
       },
     );
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 5

  Array [
-   ObjectContaining {
-     "id": undefined,

[Killed] BlockStatement
services/orderService.js:41:24
 }
 
 function getMyOrders(db) {
-  return (req, res) => {
-    db.all(
-      "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",
-      [req.user.id],
-      (err, orders) => {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json(orders || []);
-      },
-    );
-  };
+  return (req, res) => {};
 }
 
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrayDeclaration
services/orderService.js:44:7
   return (req, res) => {
     db.all(
       "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",
-      [req.user.id],
+      [],
       (err, orders) => {
         if (err) return res.status(500).json({ error: err.message });
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [ObjectContaining {"id": 1, "status": "pending", "total_amount": 250000}]
Received: {"error": "Expected 1 query parameters"}

[Killed] BlockStatement
services/orderService.js:45:24
     db.all(
       "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",
       [req.user.id],
-      (err, orders) => {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json(orders || []);
-      },
+      (err, orders) => {},
     );
   };
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
services/orderService.js:46:13
       "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",
       [req.user.id],
       (err, orders) => {
-        if (err) return res.status(500).json({ error: err.message });
+        if (true) return res.status(500).json({ error: err.message });
         res.json(orders || []);
       },
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [ObjectContaining {"id": 1, "status": "pending", "total_amount": 250000}]
Received: {}

[Survived] ConditionalExpression
services/orderService.js:46:13
       "SELECT * FROM orders WHERE user_id = ? ORDER BY id DESC",
       [req.user.id],
       (err, orders) => {
-        if (err) return res.status(500).json({ error: err.message });
+        if (false) return res.status(500).json({ error: err.message });
         res.json(orders || []);
       },

[Killed] ConditionalExpression
services/orderService.js:47:18
       [req.user.id],
       (err, orders) => {
         if (err) return res.status(500).json({ error: err.message });
-        res.json(orders || []);
+        res.json(true);
       },
     );
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [ObjectContaining {"id": 1, "status": "pending", "total_amount": 250000}]
Received: true

[Killed] LogicalOperator
services/orderService.js:47:18
       [req.user.id],
       (err, orders) => {
         if (err) return res.status(500).json({ error: err.message });
-        res.json(orders || []);
+        res.json(orders && []);
       },
     );
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   ObjectContaining {
-     "id": 1,

[Killed] BlockStatement
services/orderService.js:54:24
 }
 
 function cancelOrder(db) {
-  return (req, res) => {
-    db.get(
-      "SELECT * FROM orders WHERE id = ? AND user_id = ?",
-      [req.params.id, req.user.id],
-      (err, order) => {
-        if (err) return res.status(500).json({ error: err.message });
-        if (!order) return res.status(404).json({ error: "Order not found" });
-
-        // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-        if (order.status === "delivered" || order.status === "canceled") {
-          return res.status(400).json({ error: "Cannot cancel this order." });
-        }
-
-        db.run(
-          "UPDATE orders SET status = ? WHERE id = ?",
-          ["canceled", req.params.id],
-          function (err) {
-            if (err) return res.status(500).json({ error: err.message });
-            res.json({ message: "Order canceled successfully" });
-          },
-        );
-      },
-    );
-  };
+  return (req, res) => {};
 }
 
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
services/orderService.js:56:7
 function cancelOrder(db) {
   return (req, res) => {
     db.get(
-      "SELECT * FROM orders WHERE id = ? AND user_id = ?",
+      "",
       [req.params.id, req.user.id],
       (err, order) => {
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ArrayDeclaration
services/orderService.js:57:7
   return (req, res) => {
     db.get(
       "SELECT * FROM orders WHERE id = ? AND user_id = ?",
-      [req.params.id, req.user.id],
+      [],
       (err, order) => {
         if (err) return res.status(500).json({ error: err.message });
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
services/orderService.js:58:23
     db.get(
       "SELECT * FROM orders WHERE id = ? AND user_id = ?",
       [req.params.id, req.user.id],
-      (err, order) => {
-        if (err) return res.status(500).json({ error: err.message });
-        if (!order) return res.status(404).json({ error: "Order not found" });
-
-        // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-        if (order.status === "delivered" || order.status === "canceled") {
-          return res.status(400).json({ error: "Cannot cancel this order." });
-        }
-
-        db.run(
-          "UPDATE orders SET status = ? WHERE id = ?",
-          ["canceled", req.params.id],
-          function (err) {
-            if (err) return res.status(500).json({ error: err.message });
-            res.json({ message: "Order canceled successfully" });
-          },
-        );
-      },
+      (err, order) => {},
     );
   };
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
services/orderService.js:59:13
       "SELECT * FROM orders WHERE id = ? AND user_id = ?",
       [req.params.id, req.user.id],
       (err, order) => {
-        if (err) return res.status(500).json({ error: err.message });
+        if (true) return res.status(500).json({ error: err.message });
         if (!order) return res.status(404).json({ error: "Order not found" });
 
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ConditionalExpression
services/orderService.js:59:13
       "SELECT * FROM orders WHERE id = ? AND user_id = ?",
       [req.params.id, req.user.id],
       (err, order) => {
-        if (err) return res.status(500).json({ error: err.message });
+        if (false) return res.status(500).json({ error: err.message });
         if (!order) return res.status(404).json({ error: "Order not found" });
 

[Killed] ConditionalExpression
services/orderService.js:60:13
       [req.params.id, req.user.id],
       (err, order) => {
         if (err) return res.status(500).json({ error: err.message });
-        if (!order) return res.status(404).json({ error: "Order not found" });
+        if (false) return res.status(404).json({ error: "Order not found" });
 
         // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
killedBy: order API baseline tests reports missing orders
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ConditionalExpression
services/orderService.js:60:13
       [req.params.id, req.user.id],
       (err, order) => {
         if (err) return res.status(500).json({ error: err.message });
-        if (!order) return res.status(404).json({ error: "Order not found" });
+        if (true) return res.status(404).json({ error: "Order not found" });
 
         // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] LogicalOperator
services/orderService.js:63:13
         if (!order) return res.status(404).json({ error: "Order not found" });
 
         // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-        if (order.status === "delivered" || order.status === "canceled") {
+        if (order.status === "delivered" && order.status === "canceled") {
           return res.status(400).json({ error: "Cannot cancel this order." });
         }
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] EqualityOperator
services/orderService.js:63:13
         if (!order) return res.status(404).json({ error: "Order not found" });
 
         // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-        if (order.status === "delivered" || order.status === "canceled") {
+        if (order.status !== "delivered" || order.status === "canceled") {
           return res.status(400).json({ error: "Cannot cancel this order." });
         }
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] StringLiteral
services/orderService.js:69:12
 
         db.run(
           "UPDATE orders SET status = ? WHERE id = ?",
-          ["canceled", req.params.id],
+          ["", req.params.id],
           function (err) {
             if (err) return res.status(500).json({ error: err.message });
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ArrayDeclaration
services/orderService.js:69:11
 
         db.run(
           "UPDATE orders SET status = ? WHERE id = ?",
-          ["canceled", req.params.id],
+          [],
           function (err) {
             if (err) return res.status(500).json({ error: err.message });
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
services/orderService.js:70:26
         db.run(
           "UPDATE orders SET status = ? WHERE id = ?",
           ["canceled", req.params.id],
-          function (err) {
-            if (err) return res.status(500).json({ error: err.message });
-            res.json({ message: "Order canceled successfully" });
-          },
+          function (err) {},
         );
       },
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
services/orderService.js:72:33
           ["canceled", req.params.id],
           function (err) {
             if (err) return res.status(500).json({ error: err.message });
-            res.json({ message: "Order canceled successfully" });
+            res.json({ message: "" });
           },
         );
killedBy: order API baseline tests cancels a pending order and rejects a second cancellation
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Order canceled successfully",
+   "message": "",

[Killed] BlockStatement
services/orderService.js:81:24
 }
 
 function getOrderById(db) {
-  return (req, res) => {
-    db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-      if (err) return res.status(500).json({ error: err.message });
-      if (!order) return res.status(404).json({ error: "Order not found" });
-      res.json(order);
-    });
-  };
+  return (req, res) => {};
 }
 
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
services/orderService.js:82:82
 
 function getOrderById(db) {
   return (req, res) => {
-    db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-      if (err) return res.status(500).json({ error: err.message });
-      if (!order) return res.status(404).json({ error: "Order not found" });
-      res.json(order);
-    });
+    db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {});
   };
 }
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
services/orderService.js:82:12
 
 function getOrderById(db) {
   return (req, res) => {
-    db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
+    db.get("", [req.params.id], (err, order) => {
       if (err) return res.status(500).json({ error: err.message });
       if (!order) return res.status(404).json({ error: "Order not found" });
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

- ObjectContaining {
-   "id": 1,
-   "shipping_address": "123 Baseline Street",

[Killed] ConditionalExpression
services/orderService.js:83:11
 function getOrderById(db) {
   return (req, res) => {
     db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-      if (err) return res.status(500).json({ error: err.message });
+      if (true) return res.status(500).json({ error: err.message });
       if (!order) return res.status(404).json({ error: "Order not found" });
       res.json(order);
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- ObjectContaining {
-   "id": 1,
-   "shipping_address": "123 Baseline Street",

[Survived] ConditionalExpression
services/orderService.js:83:11
 function getOrderById(db) {
   return (req, res) => {
     db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
-      if (err) return res.status(500).json({ error: err.message });
+      if (false) return res.status(500).json({ error: err.message });
       if (!order) return res.status(404).json({ error: "Order not found" });
       res.json(order);

[Killed] BooleanLiteral
services/orderService.js:84:11
   return (req, res) => {
     db.get("SELECT * FROM orders WHERE id = ?", [req.params.id], (err, order) => {
       if (err) return res.status(500).json({ error: err.message });
-      if (!order) return res.status(404).json({ error: "Order not found" });
+      if (order) return res.status(404).json({ error: "Order not found" });
       res.json(order);
     });
killedBy: order API baseline tests checks out and reads order history and details
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

- ObjectContaining {
-   "id": 1,
-   "shipping_address": "123 Baseline Street",

[Killed] ConditionalExpression
services/orderService.js:94:9
   return (req, res) => {
     const { code, total_amount, user_id } = req.body;
 
-    if (!code)
+    if (false)
       return res.status(400).json({ error: "Vui lòng nhập mã giảm giá" });
 
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] ConditionalExpression
services/orderService.js:94:9
   return (req, res) => {
     const { code, total_amount, user_id } = req.body;
 
-    if (!code)
+    if (true)
       return res.status(400).json({ error: "Vui lòng nhập mã giảm giá" });
 
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Survived] ObjectLiteral
services/orderService.js:95:35
     const { code, total_amount, user_id } = req.body;
 
     if (!code)
-      return res.status(400).json({ error: "Vui lòng nhập mã giảm giá" });
+      return res.status(400).json({});
 
     db.get(

[Killed] ConditionalExpression
services/orderService.js:101:13
       "SELECT * FROM coupons WHERE code = ? AND is_active = 1",
       [code],
       (err, coupon) => {
-        if (err) return res.status(500).json({ error: err.message });
+        if (true) return res.status(500).json({ error: err.message });
         if (!coupon) {
           return res
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Survived] ConditionalExpression
services/orderService.js:101:13
       "SELECT * FROM coupons WHERE code = ? AND is_active = 1",
       [code],
       (err, coupon) => {
-        if (err) return res.status(500).json({ error: err.message });
+        if (false) return res.status(500).json({ error: err.message });
         if (!coupon) {
           return res

[Killed] BlockStatement
services/orderService.js:102:22
       [code],
       (err, coupon) => {
         if (err) return res.status(500).json({ error: err.message });
-        if (!coupon) {
-          return res
-            .status(404)
-            .json({ error: "Mã giảm giá không tồn tại hoặc đã bị vô hiệu hóa" });
-        }
+        if (!coupon) {}
 
         if (total_amount > coupon.min_order_amount) {
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ConditionalExpression
services/orderService.js:102:13
       [code],
       (err, coupon) => {
         if (err) return res.status(500).json({ error: err.message });
-        if (!coupon) {
+        if (false) {
           return res
             .status(404)
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] EqualityOperator
services/orderService.js:108:13
             .json({ error: "Mã giảm giá không tồn tại hoặc đã bị vô hiệu hóa" });
         }
 
-        if (total_amount > coupon.min_order_amount) {
+        if (total_amount <= coupon.min_order_amount) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

  Object {
-   "coupon_id": 2,
-   "discount_amount": 50000,

[Killed] ConditionalExpression
services/orderService.js:108:13
             .json({ error: "Mã giảm giá không tồn tại hoặc đã bị vô hiệu hóa" });
         }
 
-        if (total_amount > coupon.min_order_amount) {
+        if (false) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

  Object {
-   "coupon_id": 2,
-   "discount_amount": 50000,

[Killed] ConditionalExpression
services/orderService.js:111:15
         if (total_amount > coupon.min_order_amount) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
-          if (expiry < now) {
+          if (true) {
             return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
           }
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

  Object {
-   "coupon_id": 2,
-   "discount_amount": 50000,

[Killed] EqualityOperator
services/orderService.js:111:15
         if (total_amount > coupon.min_order_amount) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
-          if (expiry < now) {
+          if (expiry >= now) {
             return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
           }
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

  Object {
-   "coupon_id": 2,
-   "discount_amount": 50000,

[NoCoverage] ObjectLiteral
services/orderService.js:112:41
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
           if (expiry < now) {
-            return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
+            return res.status(400).json({});
           }
 

[NoCoverage] StringLiteral
services/orderService.js:112:50
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
           if (expiry < now) {
-            return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
+            return res.status(400).json({ error: "" });
           }
 
