[Timeout] BlockStatement
services/authService.js:6:24
 const SECRET_KEY = "super_secret_key_that_should_not_be_here";
 
 function registerUser(db) {
-  return (req, res) => {
-    const { name, email, password } = req.body;
-    db.run(
-      "INSERT INTO users (name, email, password) VALUES (?, ?, ?)",
-      [name, email, password],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "User registered successfully", id: this.lastID });
-      },
-    );
-  };
+  return (req, res) => {};
 }
 

[Killed] ArrayDeclaration
services/authService.js:10:7
     const { name, email, password } = req.body;
     db.run(
       "INSERT INTO users (name, email, password) VALUES (?, ?, ?)",
-      [name, email, password],
+      [],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });
killedBy: authentication API improved tests rejects duplicate registration with the same email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Timeout] BlockStatement
services/authService.js:11:22
     db.run(
       "INSERT INTO users (name, email, password) VALUES (?, ?, ?)",
       [name, email, password],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "User registered successfully", id: this.lastID });
-      },
+      function (err) {},
     );
   };

[Killed] ObjectLiteral
services/authService.js:13:18
       [name, email, password],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "User registered successfully", id: this.lastID });
+        res.json({});
       },
     );
killedBy: authentication API improved tests registers a user and returns a useful response body
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- ObjectContaining {
-   "id": Any<Number>,
-   "message": "User registered successfully",

[Killed] ArrayDeclaration
services/authService.js:23:51
   return (req, res) => {
     const { email, password } = req.body;
 
-    db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
+    db.get("SELECT * FROM users WHERE email = ?", [], (err, user) => {
       if (err) return res.status(500).json({ error: err.message });
       if (!user) {
killedBy: authentication API improved tests logs in with a registered user and returns a JWT containing user data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
services/authService.js:24:11
     const { email, password } = req.body;
 
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-      if (err) return res.status(500).json({ error: err.message });
+      if (true) return res.status(500).json({ error: err.message });
       if (!user) {
         return res.status(401).json({ error: "Invalid email or password" });
killedBy: authentication API improved tests logs in with a registered user and returns a JWT containing user data
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Timeout] ConditionalExpression
services/authService.js:24:11
     const { email, password } = req.body;
 
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-      if (err) return res.status(500).json({ error: err.message });
+      if (false) return res.status(500).json({ error: err.message });
       if (!user) {
         return res.status(401).json({ error: "Invalid email or password" });

[Killed] BlockStatement
services/authService.js:25:18
 
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
       if (err) return res.status(500).json({ error: err.message });
-      if (!user) {
-        return res.status(401).json({ error: "Invalid email or password" });
-      }
+      if (!user) {}
 
       if (user.locked_until && new Date() < new Date(user.locked_until)) {
killedBy: authentication API improved tests rejects login for an unknown email
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] ConditionalExpression
services/authService.js:25:11
 
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
       if (err) return res.status(500).json({ error: err.message });
-      if (!user) {
+      if (true) {
         return res.status(401).json({ error: "Invalid email or password" });
       }

[Killed] ConditionalExpression
services/authService.js:29:32
         return res.status(401).json({ error: "Invalid email or password" });
       }
 
-      if (user.locked_until && new Date() < new Date(user.locked_until)) {
+      if (user.locked_until && true) {
         return res
           .status(403)
killedBy: authentication API improved tests locks a user after repeated wrong passwords
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
services/authService.js:29:74
         return res.status(401).json({ error: "Invalid email or password" });
       }
 
-      if (user.locked_until && new Date() < new Date(user.locked_until)) {
-        return res
-          .status(403)
-          .json({ error: "Tài khoản đã bị khóa. Vui lòng thử lại sau." });
-      }
+      if (user.locked_until && new Date() < new Date(user.locked_until)) {}
 
       if (user.password === password) {
killedBy: authentication API improved tests locks a user after repeated wrong passwords
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
services/authService.js:32:26
       if (user.locked_until && new Date() < new Date(user.locked_until)) {
         return res
           .status(403)
-          .json({ error: "Tài khoản đã bị khóa. Vui lòng thử lại sau." });
+          .json({ error: "" });
       }
 
killedBy: authentication API improved tests locks a user after repeated wrong passwords
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] ConditionalExpression
services/authService.js:35:11
           .json({ error: "Tài khoản đã bị khóa. Vui lòng thử lại sau." });
       }
 
-      if (user.password === password) {
+      if (false) {
         db.run(
           "UPDATE users SET login_attempts = 0, locked_until = NULL WHERE id = ?",

[Timeout] EqualityOperator
services/authService.js:35:11
           .json({ error: "Tài khoản đã bị khóa. Vui lòng thử lại sau." });
       }
 
-      if (user.password === password) {
+      if (user.password !== password) {
         db.run(
           "UPDATE users SET login_attempts = 0, locked_until = NULL WHERE id = ?",

[Killed] StringLiteral
services/authService.js:37:11
 
       if (user.password === password) {
         db.run(
-          "UPDATE users SET login_attempts = 0, locked_until = NULL WHERE id = ?",
+          "",
           [user.id],
         );
killedBy: authentication API improved tests logs in with a registered user and returns a JWT containing user data
statusReason: Error: SQLITE_ERROR: no such table: products, Error: SQLITE_ERROR: no such table: products, Error: SQLITE_ERROR: no such table: products, Error: SQLITE_ERROR: no such table: products, Error: SQLITE_ERROR: no such table: coupons, Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] ObjectLiteral
services/authService.js:40:32
           "UPDATE users SET login_attempts = 0, locked_until = NULL WHERE id = ?",
           [user.id],
         );
-        const token = jwt.sign({ id: user.id, role: user.role }, SECRET_KEY);
+        const token = jwt.sign({}, SECRET_KEY);
         res.json({ message: "Login successful", token, user });
       } else {

[Timeout] StringLiteral
services/authService.js:41:29
           [user.id],
         );
         const token = jwt.sign({ id: user.id, role: user.role }, SECRET_KEY);
-        res.json({ message: "Login successful", token, user });
+        res.json({ message: "", token, user });
       } else {
         const newAttempts = user.login_attempts + 2;

[Killed] BlockStatement
services/authService.js:42:14
         );
         const token = jwt.sign({ id: user.id, role: user.role }, SECRET_KEY);
         res.json({ message: "Login successful", token, user });
-      } else {
-        const newAttempts = user.login_attempts + 2;
-        let lockedUntil = null;
-        if (newAttempts >= 3) {
-          lockedUntil = new Date(Date.now() + 180000).toISOString();
-        }
-        db.run(
-          "UPDATE users SET login_attempts = ?, locked_until = ? WHERE id = ?",
-          [newAttempts, lockedUntil, user.id],
-        );
-        res.status(401).json({ error: "Invalid email or password" });
-      }
+      } else {}
     });
   };
killedBy: authentication API improved tests rejects login with a wrong password

[Timeout] ArithmeticOperator
services/authService.js:43:29
         const token = jwt.sign({ id: user.id, role: user.role }, SECRET_KEY);
         res.json({ message: "Login successful", token, user });
       } else {
-        const newAttempts = user.login_attempts + 2;
+        const newAttempts = user.login_attempts - 2;
         let lockedUntil = null;
         if (newAttempts >= 3) {

[Killed] EqualityOperator
services/authService.js:45:13
       } else {
         const newAttempts = user.login_attempts + 2;
         let lockedUntil = null;
-        if (newAttempts >= 3) {
+        if (newAttempts < 3) {
           lockedUntil = new Date(Date.now() + 180000).toISOString();
         }
killedBy: authentication API improved tests rejects login with a wrong password
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
services/authService.js:45:13
       } else {
         const newAttempts = user.login_attempts + 2;
         let lockedUntil = null;
-        if (newAttempts >= 3) {
+        if (false) {
           lockedUntil = new Date(Date.now() + 180000).toISOString();
         }
killedBy: authentication API improved tests rejects login with a wrong password
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArithmeticOperator
services/authService.js:46:34
         const newAttempts = user.login_attempts + 2;
         let lockedUntil = null;
         if (newAttempts >= 3) {
-          lockedUntil = new Date(Date.now() + 180000).toISOString();
+          lockedUntil = new Date(Date.now() - 180000).toISOString();
         }
         db.run(
killedBy: authentication API improved tests locks a user after repeated wrong passwords
statusReason: Error: SQLITE_CONSTRAINT: UNIQUE constraint failed: coupons.code, Error: SQLITE_CONSTRAINT: UNIQUE constraint failed: coupons.code, Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] ArrayDeclaration
services/authService.js:50:11
         }
         db.run(
           "UPDATE users SET login_attempts = ?, locked_until = ? WHERE id = ?",
-          [newAttempts, lockedUntil, user.id],
+          [],
         );
         res.status(401).json({ error: "Invalid email or password" });
killedBy: authentication API improved tests rejects login with a wrong password
statusReason: Error: SQLITE_BUSY: database is locked, Error: SQLITE_BUSY: database is locked, Error: SQLITE_ERROR: table categories already exists, Error: SQLITE_ERROR: table coupons already exists, Error: SQLITE_ERROR: table coupon_usage already exists

[Killed] StringLiteral
services/authService.js:52:39
           "UPDATE users SET login_attempts = ?, locked_until = ? WHERE id = ?",
           [newAttempts, lockedUntil, user.id],
         );
-        res.status(401).json({ error: "Invalid email or password" });
+        res.status(401).json({ error: "" });
       }
     });
killedBy: authentication API improved tests rejects login with a wrong password

[NoCoverage] BlockStatement
services/authService.js:59:24
 }
 
 function forgotPassword(db) {
-  return (req, res) => {
-    const { email } = req.body;
-    db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-      if (!user) return res.status(404).json({ error: "User not found" });
-      const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
-      db.run(
-        "UPDATE users SET reset_token = ? WHERE id = ?",
-        [resetToken, user.id],
-        (err) => {
-          if (err) return res.status(500).json({ error: err.message });
-          res.json({
-            message: "Mã đặt lại mật khẩu đã được tạo",
-            resetToken: resetToken,
-          });
-        },
-      );
-    });
-  };
+  return (req, res) => {};
 }
 

[NoCoverage] BlockStatement
services/authService.js:61:75
 function forgotPassword(db) {
   return (req, res) => {
     const { email } = req.body;
-    db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-      if (!user) return res.status(404).json({ error: "User not found" });
-      const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
-      db.run(
-        "UPDATE users SET reset_token = ? WHERE id = ?",
-        [resetToken, user.id],
-        (err) => {
-          if (err) return res.status(500).json({ error: err.message });
-          res.json({
-            message: "Mã đặt lại mật khẩu đã được tạo",
-            resetToken: resetToken,
-          });
-        },
-      );
-    });
+    db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {});
   };
 }

[NoCoverage] ArrayDeclaration
services/authService.js:61:51
 function forgotPassword(db) {
   return (req, res) => {
     const { email } = req.body;
-    db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
+    db.get("SELECT * FROM users WHERE email = ?", [], (err, user) => {
       if (!user) return res.status(404).json({ error: "User not found" });
       const resetToken = Math.floor(1000 + Math.random() * 9000).toString();

[NoCoverage] ConditionalExpression
services/authService.js:62:11
   return (req, res) => {
     const { email } = req.body;
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-      if (!user) return res.status(404).json({ error: "User not found" });
+      if (false) return res.status(404).json({ error: "User not found" });
       const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
       db.run(

[NoCoverage] ConditionalExpression
services/authService.js:62:11
   return (req, res) => {
     const { email } = req.body;
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
-      if (!user) return res.status(404).json({ error: "User not found" });
+      if (true) return res.status(404).json({ error: "User not found" });
       const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
       db.run(

[NoCoverage] ArithmeticOperator
services/authService.js:63:44
     const { email } = req.body;
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
       if (!user) return res.status(404).json({ error: "User not found" });
-      const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
+      const resetToken = Math.floor(1000 + Math.random() / 9000).toString();
       db.run(
         "UPDATE users SET reset_token = ? WHERE id = ?",

[NoCoverage] ArithmeticOperator
services/authService.js:63:37
     const { email } = req.body;
     db.get("SELECT * FROM users WHERE email = ?", [email], (err, user) => {
       if (!user) return res.status(404).json({ error: "User not found" });
-      const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
+      const resetToken = Math.floor(1000 - Math.random() * 9000).toString();
       db.run(
         "UPDATE users SET reset_token = ? WHERE id = ?",

[NoCoverage] StringLiteral
services/authService.js:65:9
       if (!user) return res.status(404).json({ error: "User not found" });
       const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
       db.run(
-        "UPDATE users SET reset_token = ? WHERE id = ?",
+        "",
         [resetToken, user.id],
         (err) => {

[NoCoverage] ArrayDeclaration
services/authService.js:66:9
       const resetToken = Math.floor(1000 + Math.random() * 9000).toString();
       db.run(
         "UPDATE users SET reset_token = ? WHERE id = ?",
-        [resetToken, user.id],
+        [],
         (err) => {
           if (err) return res.status(500).json({ error: err.message });

[NoCoverage] BlockStatement
services/authService.js:67:18
       db.run(
         "UPDATE users SET reset_token = ? WHERE id = ?",
         [resetToken, user.id],
-        (err) => {
-          if (err) return res.status(500).json({ error: err.message });
-          res.json({
-            message: "Mã đặt lại mật khẩu đã được tạo",
-            resetToken: resetToken,
-          });
-        },
+        (err) => {},
       );
     });

[NoCoverage] ConditionalExpression
services/authService.js:68:15
         "UPDATE users SET reset_token = ? WHERE id = ?",
         [resetToken, user.id],
         (err) => {
-          if (err) return res.status(500).json({ error: err.message });
+          if (true) return res.status(500).json({ error: err.message });
           res.json({
             message: "Mã đặt lại mật khẩu đã được tạo",

[NoCoverage] ConditionalExpression
services/authService.js:68:15
         "UPDATE users SET reset_token = ? WHERE id = ?",
         [resetToken, user.id],
         (err) => {
-          if (err) return res.status(500).json({ error: err.message });
+          if (false) return res.status(500).json({ error: err.message });
           res.json({
             message: "Mã đặt lại mật khẩu đã được tạo",

[NoCoverage] BlockStatement
services/authService.js:80:24
 }
 
 function resetPassword(db) {
-  return (req, res) => {
-    const { email, resetToken, newPassword } = req.body;
-    db.run(
-      "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
-      [newPassword, email, resetToken],
-      function (err) {
-        if (this.changes === 0) {
-          return res.status(400).json({ error: "Invalid token or email" });
-        }
-        res.json({ message: "Password reset successfully" });
-      },
-    );
-  };
+  return (req, res) => {};
 }
 

[NoCoverage] BlockStatement
services/authService.js:85:22
     db.run(
       "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
       [newPassword, email, resetToken],
-      function (err) {
-        if (this.changes === 0) {
-          return res.status(400).json({ error: "Invalid token or email" });
-        }
-        res.json({ message: "Password reset successfully" });
-      },
+      function (err) {},
     );
   };

[NoCoverage] EqualityOperator
services/authService.js:86:13
       "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
       [newPassword, email, resetToken],
       function (err) {
-        if (this.changes === 0) {
+        if (this.changes !== 0) {
           return res.status(400).json({ error: "Invalid token or email" });
         }

[NoCoverage] ConditionalExpression
services/authService.js:86:13
       "UPDATE users SET password = ?, reset_token = NULL WHERE email = ? AND reset_token = ?",
       [newPassword, email, resetToken],
       function (err) {
-        if (this.changes === 0) {
+        if (false) {
           return res.status(400).json({ error: "Invalid token or email" });
         }

[NoCoverage] StringLiteral
services/authService.js:87:48
       [newPassword, email, resetToken],
       function (err) {
         if (this.changes === 0) {
-          return res.status(400).json({ error: "Invalid token or email" });
+          return res.status(400).json({ error: "" });
         }
         res.json({ message: "Password reset successfully" });

[Killed] BlockStatement
services/authService.js:95:44
   };
 }
 
-function authenticateToken(req, res, next) {
-  const authHeader = req.headers["authorization"];
-  const token = authHeader && authHeader.split(" ")[1];
-  if (token == null) return res.status(401).json({ error: "Unauthorized" });
-
-  jwt.verify(token, SECRET_KEY, (err, user) => {
-    if (err) return res.status(403).json({ error: "Forbidden" });
-    req.user = user;
-    next();
-  });
-}
+function authenticateToken(req, res, next) {}
 
 function getCurrentUser(db) {
killedBy: authentication API improved tests requires a token for current user profile
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
services/authService.js:96:34
 }
 
 function authenticateToken(req, res, next) {
-  const authHeader = req.headers["authorization"];
+  const authHeader = req.headers[""];
   const token = authHeader && authHeader.split(" ")[1];
   if (token == null) return res.status(401).json({ error: "Unauthorized" });
killedBy: authentication API improved tests reads current user profile with a valid token
statusReason: 
Expected: 200
Received: 401

[Killed] LogicalOperator
services/authService.js:97:17
 
 function authenticateToken(req, res, next) {
   const authHeader = req.headers["authorization"];
-  const token = authHeader && authHeader.split(" ")[1];
+  const token = authHeader || authHeader.split(" ")[1];
   if (token == null) return res.status(401).json({ error: "Unauthorized" });
 
killedBy: authentication API improved tests requires a token for current user profile
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] ConditionalExpression
services/authService.js:97:17
 
 function authenticateToken(req, res, next) {
   const authHeader = req.headers["authorization"];
-  const token = authHeader && authHeader.split(" ")[1];
+  const token = false;
   if (token == null) return res.status(401).json({ error: "Unauthorized" });
 
killedBy: authentication API improved tests requires a token for current user profile
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 403

[Killed] ConditionalExpression
services/authService.js:98:7
 function authenticateToken(req, res, next) {
   const authHeader = req.headers["authorization"];
   const token = authHeader && authHeader.split(" ")[1];
-  if (token == null) return res.status(401).json({ error: "Unauthorized" });
+  if (true) return res.status(401).json({ error: "Unauthorized" });
 
   jwt.verify(token, SECRET_KEY, (err, user) => {
killedBy: authentication API improved tests reads current user profile with a valid token
statusReason: 
Expected: 200
Received: 500

[Killed] EqualityOperator
services/authService.js:98:7
 function authenticateToken(req, res, next) {
   const authHeader = req.headers["authorization"];
   const token = authHeader && authHeader.split(" ")[1];
-  if (token == null) return res.status(401).json({ error: "Unauthorized" });
+  if (token != null) return res.status(401).json({ error: "Unauthorized" });
 
   jwt.verify(token, SECRET_KEY, (err, user) => {
killedBy: authentication API improved tests requires a token for current user profile
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 403

[Killed] BlockStatement
services/authService.js:100:48
   const token = authHeader && authHeader.split(" ")[1];
   if (token == null) return res.status(401).json({ error: "Unauthorized" });
 
-  jwt.verify(token, SECRET_KEY, (err, user) => {
-    if (err) return res.status(403).json({ error: "Forbidden" });
-    req.user = user;
-    next();
-  });
+  jwt.verify(token, SECRET_KEY, (err, user) => {});
 }
 
killedBy: authentication API improved tests reads current user profile with a valid token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
services/authService.js:101:9
   if (token == null) return res.status(401).json({ error: "Unauthorized" });
 
   jwt.verify(token, SECRET_KEY, (err, user) => {
-    if (err) return res.status(403).json({ error: "Forbidden" });
+    if (true) return res.status(403).json({ error: "Forbidden" });
     req.user = user;
     next();
killedBy: authentication API improved tests reads current user profile with a valid token
statusReason: 
Expected: 200
Received: 403

[Killed] ConditionalExpression
services/authService.js:101:9
   if (token == null) return res.status(401).json({ error: "Unauthorized" });
 
   jwt.verify(token, SECRET_KEY, (err, user) => {
-    if (err) return res.status(403).json({ error: "Forbidden" });
+    if (false) return res.status(403).json({ error: "Forbidden" });
     req.user = user;
     next();
killedBy: authentication API improved tests reads current user profile with a valid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
services/authService.js:108:24
 }
 
 function getCurrentUser(db) {
-  return (req, res) => {
-    db.get("SELECT * FROM users WHERE id = ?", [req.user.id], (err, user) => {
-      res.json(user);
-    });
-  };
+  return (req, res) => {};
 }
 
killedBy: authentication API improved tests reads current user profile with a valid token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
services/authService.js:109:78
 
 function getCurrentUser(db) {
   return (req, res) => {
-    db.get("SELECT * FROM users WHERE id = ?", [req.user.id], (err, user) => {
-      res.json(user);
-    });
+    db.get("SELECT * FROM users WHERE id = ?", [req.user.id], (err, user) => {});
   };
 }
killedBy: authentication API improved tests reads current user profile with a valid token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[NoCoverage] BlockStatement
services/authService.js:116:24
 }
 
 function updateCurrentUser(db) {
-  return (req, res) => {
-    const { name, shipping_address, phone, role } = req.body;
-
-    let query = "UPDATE users SET name = ?, shipping_address = ?, phone = ?";
-    let params = [name, shipping_address, phone];
-
-    if (role) {
-      query += ", role = ?";
-      params.push(role);
-    }
-    query += " WHERE id = ?";
-    params.push(req.user.id);
-
-    db.run(query, params, function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Profile updated" });
-    });
-  };
+  return (req, res) => {};
 }
 

[NoCoverage] BlockStatement
services/authService.js:122:15
     let query = "UPDATE users SET name = ?, shipping_address = ?, phone = ?";
     let params = [name, shipping_address, phone];
 
-    if (role) {
-      query += ", role = ?";
-      params.push(role);
-    }
+    if (role) {}
     query += " WHERE id = ?";
     params.push(req.user.id);

[NoCoverage] ConditionalExpression
services/authService.js:122:9
     let query = "UPDATE users SET name = ?, shipping_address = ?, phone = ?";
     let params = [name, shipping_address, phone];
 
-    if (role) {
+    if (false) {
       query += ", role = ?";
       params.push(role);

[NoCoverage] BlockStatement
services/authService.js:129:42
     query += " WHERE id = ?";
     params.push(req.user.id);
 
-    db.run(query, params, function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Profile updated" });
-    });
+    db.run(query, params, function (err) {});
   };
 }

[NoCoverage] ConditionalExpression
services/authService.js:130:11
     params.push(req.user.id);
 
     db.run(query, params, function (err) {
-      if (err) return res.status(500).json({ error: err.message });
+      if (false) return res.status(500).json({ error: err.message });
       res.json({ message: "Profile updated" });
     });
