[Survived] ConditionalExpression
services/orderService.js:115:15
             return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
           }
 
-          if (user_id) {
+          if (true) {
             db.get(
               "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",

[Survived] ConditionalExpression
services/orderService.js:115:15
             return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
           }
 
-          if (user_id) {
+          if (false) {
             db.get(
               "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",

[NoCoverage] ArrayDeclaration
services/orderService.js:118:15
           if (user_id) {
             db.get(
               "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",
-              [coupon.id, user_id],
+              [],
               (err, result) => {
                 if (err) return res.status(500).json({ error: err.message });

[NoCoverage] ConditionalExpression
services/orderService.js:120:21
               "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",
               [coupon.id, user_id],
               (err, result) => {
-                if (err) return res.status(500).json({ error: err.message });
+                if (true) return res.status(500).json({ error: err.message });
                 if (result && result.usage_count >= coupon.max_uses_per_user) {
                   return res.status(400).json({

[NoCoverage] ConditionalExpression
services/orderService.js:120:21
               "SELECT COUNT(*) as usage_count FROM coupon_usage WHERE coupon_id = ? AND user_id = ?",
               [coupon.id, user_id],
               (err, result) => {
-                if (err) return res.status(500).json({ error: err.message });
+                if (false) return res.status(500).json({ error: err.message });
                 if (result && result.usage_count >= coupon.max_uses_per_user) {
                   return res.status(400).json({

[NoCoverage] BlockStatement
services/orderService.js:121:79
               [coupon.id, user_id],
               (err, result) => {
                 if (err) return res.status(500).json({ error: err.message });
-                if (result && result.usage_count >= coupon.max_uses_per_user) {
-                  return res.status(400).json({
-                    error: `Bạn đã sử dụng mã này ${coupon.max_uses_per_user} lần (đã đạt giới hạn)`,
-                  });
-                }
+                if (result && result.usage_count >= coupon.max_uses_per_user) {}
 
                 let discount_amount = 0;

[NoCoverage] ConditionalExpression
services/orderService.js:121:31
               [coupon.id, user_id],
               (err, result) => {
                 if (err) return res.status(500).json({ error: err.message });
-                if (result && result.usage_count >= coupon.max_uses_per_user) {
+                if (result && true) {
                   return res.status(400).json({
                     error: `Bạn đã sử dụng mã này ${coupon.max_uses_per_user} lần (đã đạt giới hạn)`,

[NoCoverage] ConditionalExpression
services/orderService.js:128:21
                 }
 
                 let discount_amount = 0;
-                if (coupon.type === "percent") {
+                if (false) {
                   discount_amount = Math.floor(
                     total_amount * (1 - coupon.discount_value),

[NoCoverage] EqualityOperator
services/orderService.js:128:21
                 }
 
                 let discount_amount = 0;
-                if (coupon.type === "percent") {
+                if (coupon.type !== "percent") {
                   discount_amount = Math.floor(
                     total_amount * (1 - coupon.discount_value),

[NoCoverage] ArithmeticOperator
services/orderService.js:130:21
                 let discount_amount = 0;
                 if (coupon.type === "percent") {
                   discount_amount = Math.floor(
-                    total_amount * (1 - coupon.discount_value),
+                    total_amount / (1 - coupon.discount_value),
                   );
                 } else {

[NoCoverage] ArithmeticOperator
services/orderService.js:130:37
                 let discount_amount = 0;
                 if (coupon.type === "percent") {
                   discount_amount = Math.floor(
-                    total_amount * (1 - coupon.discount_value),
+                    total_amount * (1 + coupon.discount_value),
                   );
                 } else {

[NoCoverage] BlockStatement
services/orderService.js:132:24
                   discount_amount = Math.floor(
                     total_amount * (1 - coupon.discount_value),
                   );
-                } else {
-                  discount_amount = coupon.discount_value;
-                }
+                } else {}
 
                 const final_amount = total_amount - discount_amount;

[NoCoverage] ArithmeticOperator
services/orderService.js:136:38
                   discount_amount = coupon.discount_value;
                 }
 
-                const final_amount = total_amount - discount_amount;
+                const final_amount = total_amount + discount_amount;
                 return res.json({
                   success: true,

[NoCoverage] EqualityOperator
services/orderService.js:142:56
                   coupon_id: coupon.id,
                   discount_amount,
                   final_amount,
-                  message: `Áp dụng thành công! Giảm ${coupon.type === "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
+                  message: `Áp dụng thành công! Giảm ${coupon.type !== "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
                 });
               },

[NoCoverage] ConditionalExpression
services/orderService.js:142:56
                   coupon_id: coupon.id,
                   discount_amount,
                   final_amount,
-                  message: `Áp dụng thành công! Giảm ${coupon.type === "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
+                  message: `Áp dụng thành công! Giảm ${false ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
                 });
               },

[Killed] BlockStatement
services/orderService.js:146:18
                 });
               },
             );
-          } else {
-            let discount_amount = 0;
-            if (coupon.type === "percent") {
-              discount_amount = Math.floor(
-                total_amount * (1 - coupon.discount_value),
-              );
-            } else {
-              discount_amount = coupon.discount_value;
-            }
-            const final_amount = total_amount - discount_amount;
-            return res.json({
-              success: true,
-              coupon_id: coupon.id,
-              discount_amount,
-              final_amount,
-              message: `Áp dụng thành công! Giảm ${coupon.type === "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
-            });
-          }
+          } else {}
         } else {
           return res.status(400).json({
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
services/orderService.js:148:17
             );
           } else {
             let discount_amount = 0;
-            if (coupon.type === "percent") {
+            if (true) {
               discount_amount = Math.floor(
                 total_amount * (1 - coupon.discount_value),
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "coupon_id": 2,
-   "discount_amount": 50000,

[Killed] ArithmeticOperator
services/orderService.js:155:34
             } else {
               discount_amount = coupon.discount_value;
             }
-            const final_amount = total_amount - discount_amount;
+            const final_amount = total_amount + discount_amount;
             return res.json({
               success: true,
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "coupon_id": 2,
    "discount_amount": 50000,

[Killed] ConditionalExpression
services/orderService.js:161:52
               coupon_id: coupon.id,
               discount_amount,
               final_amount,
-              message: `Áp dụng thành công! Giảm ${coupon.type === "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
+              message: `Áp dụng thành công! Giảm ${true ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
             });
           }
killedBy: order API baseline tests validates coupon codes and applies a fixed coupon
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "coupon_id": 2,
    "discount_amount": 50000,

[NoCoverage] BlockStatement
services/orderService.js:164:16
               message: `Áp dụng thành công! Giảm ${coupon.type === "percent" ? coupon.discount_value + "%" : coupon.discount_value.toLocaleString() + " ₫"}`,
             });
           }
-        } else {
-          return res.status(400).json({
-            error: `Đơn hàng chưa đủ giá trị tối thiểu ${coupon.min_order_amount.toLocaleString()} ₫ để áp dụng mã này`,
-          });
-        }
+        } else {}
       },
     );

[NoCoverage] ObjectLiteral
services/orderService.js:165:39
             });
           }
         } else {
-          return res.status(400).json({
-            error: `Đơn hàng chưa đủ giá trị tối thiểu ${coupon.min_order_amount.toLocaleString()} ₫ để áp dụng mã này`,
-          });
+          return res.status(400).json({});
         }
       },

[Killed] BlockStatement
services/orderService.js:175:24
 }
 
 function saveCouponUsage(db) {
-  return (req, res) => {
-    const { coupon_id } = req.body;
-    db.run(
-      "INSERT INTO coupon_usage (coupon_id, user_id) VALUES (?, ?)",
-      [coupon_id, req.user.id],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Usage recorded" });
-      },
-    );
-  };
+  return (req, res) => {};
 }
 
killedBy: order API baseline tests records coupon usage
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrayDeclaration
services/orderService.js:179:7
     const { coupon_id } = req.body;
     db.run(
       "INSERT INTO coupon_usage (coupon_id, user_id) VALUES (?, ?)",
-      [coupon_id, req.user.id],
+      [],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });
killedBy: order API baseline tests records coupon usage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
services/orderService.js:180:22
     db.run(
       "INSERT INTO coupon_usage (coupon_id, user_id) VALUES (?, ?)",
       [coupon_id, req.user.id],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Usage recorded" });
-      },
+      function (err) {},
     );
   };
killedBy: order API baseline tests records coupon usage
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
services/orderService.js:182:18
       [coupon_id, req.user.id],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Usage recorded" });
+        res.json({});
       },
     );
killedBy: order API baseline tests records coupon usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "message": "Usage recorded",
- }
