[NoCoverage] ConditionalExpression
services/authService.js:130:11
     params.push(req.user.id);
 
     db.run(query, params, function (err) {
-      if (err) return res.status(500).json({ error: err.message });
+      if (true) return res.status(500).json({ error: err.message });
       res.json({ message: "Profile updated" });
     });

[NoCoverage] StringLiteral
services/authService.js:131:27
 
     db.run(query, params, function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Profile updated" });
+      res.json({ message: "" });
     });
   };
