[NoCoverage] ObjectLiteral
services/orderService.js:33:46
       "INSERT INTO orders (user_id, total_amount, status, shipping_address) VALUES (?, ?, ?, ?)",
       [userId, total_amount, "pending", shipping_address],
       function (err) {
-        if (err) return res.status(500).json({ error: err.message });
+        if (err) return res.status(500).json({});
         res.json({ message: "Checkout successful", orderId: this.lastID });
       },

[NoCoverage] ArrayDeclaration
services/orderService.js:47:28
       [req.user.id],
       (err, orders) => {
         if (err) return res.status(500).json({ error: err.message });
-        res.json(orders || []);
+        res.json(orders || ["Stryker was here"]);
       },
     );

[Killed] ConditionalExpression
services/orderService.js:63:45
         if (!order) return res.status(404).json({ error: "Order not found" });
 
         // Lẽ ra phải là: if (order.status !== 'pending' && order.status !== 'confirmed')
-        if (order.status === "delivered" || order.status === "canceled") {
+        if (order.status === "delivered" || false) {
           return res.status(400).json({ error: "Cannot cancel this order." });
         }
killedBy: Order API improved tests Order APIs PUT /api/orders/:id/cancel cancels the order successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
services/orderService.js:102:13
       [code],
       (err, coupon) => {
         if (err) return res.status(500).json({ error: err.message });
-        if (!coupon) {
+        if (true) {
           return res
             .status(404)
killedBy: Order API improved tests Coupon APIs POST /api/apply-coupon handles expired coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] BlockStatement
services/orderService.js:111:29
         if (total_amount > coupon.min_order_amount) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
-          if (expiry < now) {
-            return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
-          }
+          if (expiry < now) {}
 
           if (user_id) {
killedBy: Order API improved tests Coupon APIs POST /api/apply-coupon handles expired coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200
