[Timeout] BlockStatement
services/authService.js:35:39
           .json({ error: "Tài khoản đã bị khóa. Vui lòng thử lại sau." });
       }
 
-      if (user.password === password) {
-        db.run(
-          "UPDATE users SET login_attempts = 0, locked_until = NULL WHERE id = ?",
-          [user.id],
-        );
-        const token = jwt.sign({ id: user.id, role: user.role }, SECRET_KEY);
-        res.json({ message: "Login successful", token, user });
-      } else {
+      if (user.password === password) {} else {
         const newAttempts = user.login_attempts + 2;
         let lockedUntil = null;

[Killed] ConditionalExpression
services/authService.js:97:17
 
 function authenticateToken(req, res, next) {
   const authHeader = req.headers["authorization"];
-  const token = authHeader && authHeader.split(" ")[1];
+  const token = true;
   if (token == null) return res.status(401).json({ error: "Unauthorized" });
 
killedBy: authentication API improved tests requires a token for current user profile
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 403

[Killed] ConditionalExpression
services/authService.js:98:7
 function authenticateToken(req, res, next) {
   const authHeader = req.headers["authorization"];
   const token = authHeader && authHeader.split(" ")[1];
-  if (token == null) return res.status(401).json({ error: "Unauthorized" });
+  if (false) return res.status(401).json({ error: "Unauthorized" });
 
   jwt.verify(token, SECRET_KEY, (err, user) => {
killedBy: authentication API improved tests requires a token for current user profile
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 403
