[Killed] EqualityOperator
services/orderService.js:108:13
             .json({ error: "Mã giảm giá không tồn tại hoặc đã bị vô hiệu hóa" });
         }
 
-        if (total_amount > coupon.min_order_amount) {
+        if (total_amount >= coupon.min_order_amount) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
killedBy: order API improved tests rejects totals below and exactly equal to the current minimum threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
services/orderService.js:111:15
         if (total_amount > coupon.min_order_amount) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
-          if (expiry < now) {
+          if (false) {
             return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
           }
killedBy: order API improved tests rejects an expired coupon
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] EqualityOperator
services/orderService.js:111:15
         if (total_amount > coupon.min_order_amount) {
           const now = new Date();
           const expiry = new Date(coupon.expired_at);
-          if (expiry < now) {
+          if (expiry <= now) {
             return res.status(400).json({ error: "Mã giảm giá đã hết hạn" });
           }
killedBy: order API improved tests distinguishes expiry exactly at the current instant
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
services/orderService.js:148:44
             );
           } else {
             let discount_amount = 0;
-            if (coupon.type === "percent") {
-              discount_amount = Math.floor(
-                total_amount * (1 - coupon.discount_value),
-              );
-            } else {
+            if (coupon.type === "percent") {} else {
               discount_amount = coupon.discount_value;
             }
killedBy: order API improved tests applies fixed and percent coupons without a user ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "coupon_id": 1,
-   "discount_amount": -4500000,
