[Killed] BlockStatement
services/productService.js:8:24
  */
 
 function listProducts(db) {
-  return (req, res) => {
-    const searchQuery = req.query.search;
-    if (searchQuery) {
-      const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
-      db.all(query, [], (err, rows) => {
-        if (err) {
-          return res
-            .status(500)
-            .send(`<h1>Database Error</h1><p>${err.message}</p>`);
-        }
-        res.json(rows);
-      });
-    } else {
-      db.all("SELECT * FROM products", [], (err, rows) => {
-        res.json(rows);
-      });
-    }
-  };
+  return (req, res) => {};
 }
 
killedBy: product API baseline (basic tests only) GET /api/products returns status 200
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
services/productService.js:10:9
 function listProducts(db) {
   return (req, res) => {
     const searchQuery = req.query.search;
-    if (searchQuery) {
+    if (true) {
       const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
       db.all(query, [], (err, rows) => {

[NoCoverage] BlockStatement
services/productService.js:10:22
 function listProducts(db) {
   return (req, res) => {
     const searchQuery = req.query.search;
-    if (searchQuery) {
-      const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
-      db.all(query, [], (err, rows) => {
-        if (err) {
-          return res
-            .status(500)
-            .send(`<h1>Database Error</h1><p>${err.message}</p>`);
-        }
-        res.json(rows);
-      });
-    } else {
+    if (searchQuery) {} else {
       db.all("SELECT * FROM products", [], (err, rows) => {
         res.json(rows);

[NoCoverage] StringLiteral
services/productService.js:11:21
   return (req, res) => {
     const searchQuery = req.query.search;
     if (searchQuery) {
-      const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
+      const query = ``;
       db.all(query, [], (err, rows) => {
         if (err) {

[NoCoverage] BlockStatement
services/productService.js:12:40
     const searchQuery = req.query.search;
     if (searchQuery) {
       const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
-      db.all(query, [], (err, rows) => {
-        if (err) {
-          return res
-            .status(500)
-            .send(`<h1>Database Error</h1><p>${err.message}</p>`);
-        }
-        res.json(rows);
-      });
+      db.all(query, [], (err, rows) => {});
     } else {
       db.all("SELECT * FROM products", [], (err, rows) => {

[NoCoverage] ArrayDeclaration
services/productService.js:12:21
     const searchQuery = req.query.search;
     if (searchQuery) {
       const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
-      db.all(query, [], (err, rows) => {
+      db.all(query, ["Stryker was here"], (err, rows) => {
         if (err) {
           return res

[NoCoverage] BlockStatement
services/productService.js:13:18
     if (searchQuery) {
       const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
       db.all(query, [], (err, rows) => {
-        if (err) {
-          return res
-            .status(500)
-            .send(`<h1>Database Error</h1><p>${err.message}</p>`);
-        }
+        if (err) {}
         res.json(rows);
       });

[NoCoverage] ConditionalExpression
services/productService.js:13:13
     if (searchQuery) {
       const query = `SELECT * FROM products WHERE name LIKE '%${searchQuery}%'`;
       db.all(query, [], (err, rows) => {
-        if (err) {
+        if (true) {
           return res
             .status(500)

[Killed] BlockStatement
services/productService.js:20:12
         }
         res.json(rows);
       });
-    } else {
-      db.all("SELECT * FROM products", [], (err, rows) => {
-        res.json(rows);
-      });
-    }
+    } else {}
   };
 }
killedBy: product API baseline (basic tests only) GET /api/products returns status 200
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
services/productService.js:21:59
         res.json(rows);
       });
     } else {
-      db.all("SELECT * FROM products", [], (err, rows) => {
-        res.json(rows);
-      });
+      db.all("SELECT * FROM products", [], (err, rows) => {});
     }
   };
killedBy: product API baseline (basic tests only) GET /api/products returns status 200
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ArrayDeclaration
services/productService.js:21:40
         res.json(rows);
       });
     } else {
-      db.all("SELECT * FROM products", [], (err, rows) => {
+      db.all("SELECT * FROM products", ["Stryker was here"], (err, rows) => {
         res.json(rows);
       });

[Killed] BlockStatement
services/productService.js:29:24
 }
 
 function getProductById(db) {
-  return (req, res) => {
-    db.get(
-      "SELECT * FROM products WHERE id = ?",
-      [req.params.id],
-      (err, row) => {
-        if (!row) return res.status(200).json({});
-        if (row.id % 2 === 0) row.price = row.price.toString();
-        res.json(row);
-      },
-    );
-  };
+  return (req, res) => {};
 }
 
killedBy: product API baseline (basic tests only) GET /api/products/:id returns status 200
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
services/productService.js:33:21
     db.get(
       "SELECT * FROM products WHERE id = ?",
       [req.params.id],
-      (err, row) => {
-        if (!row) return res.status(200).json({});
-        if (row.id % 2 === 0) row.price = row.price.toString();
-        res.json(row);
-      },
+      (err, row) => {},
     );
   };
killedBy: product API baseline (basic tests only) GET /api/products/:id returns status 200
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
services/productService.js:34:13
       "SELECT * FROM products WHERE id = ?",
       [req.params.id],
       (err, row) => {
-        if (!row) return res.status(200).json({});
+        if (true) return res.status(200).json({});
         if (row.id % 2 === 0) row.price = row.price.toString();
         res.json(row);

[Survived] BooleanLiteral
services/productService.js:34:13
       "SELECT * FROM products WHERE id = ?",
       [req.params.id],
       (err, row) => {
-        if (!row) return res.status(200).json({});
+        if (row) return res.status(200).json({});
         if (row.id % 2 === 0) row.price = row.price.toString();
         res.json(row);

[Survived] ArithmeticOperator
services/productService.js:35:13
       [req.params.id],
       (err, row) => {
         if (!row) return res.status(200).json({});
-        if (row.id % 2 === 0) row.price = row.price.toString();
+        if (row.id * 2 === 0) row.price = row.price.toString();
         res.json(row);
       },

[Survived] ConditionalExpression
services/productService.js:35:13
       [req.params.id],
       (err, row) => {
         if (!row) return res.status(200).json({});
-        if (row.id % 2 === 0) row.price = row.price.toString();
+        if (false) row.price = row.price.toString();
         res.json(row);
       },

[Killed] BlockStatement
services/productService.js:43:24
 }
 
 function createProduct(db) {
-  return (req, res) => {
-    const { name, price, description, imageUrl, category_id } = req.body;
-    db.run(
-      "INSERT INTO products (name, price, description, imageUrl, category_id) VALUES (?, ?, ?, ?, ?)",
-      [name, price, description, imageUrl, category_id],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Product created", id: this.lastID });
-      },
-    );
-  };
+  return (req, res) => {};
 }
 
killedBy: product API baseline (basic tests only) POST /api/products creates a product
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ArrayDeclaration
services/productService.js:47:7
     const { name, price, description, imageUrl, category_id } = req.body;
     db.run(
       "INSERT INTO products (name, price, description, imageUrl, category_id) VALUES (?, ?, ?, ?, ?)",
-      [name, price, description, imageUrl, category_id],
+      [],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });

[Killed] BlockStatement
services/productService.js:48:22
     db.run(
       "INSERT INTO products (name, price, description, imageUrl, category_id) VALUES (?, ?, ?, ?, ?)",
       [name, price, description, imageUrl, category_id],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Product created", id: this.lastID });
-      },
+      function (err) {},
     );
   };
killedBy: product API baseline (basic tests only) POST /api/products creates a product
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[NoCoverage] BlockStatement
services/productService.js:57:24
 }
 
 function updateProduct(db) {
-  return (req, res) => {
-    const { name, price, description, imageUrl, category_id } = req.body;
-    db.run(
-      "UPDATE products SET name = ?, price = ?, description = ?, imageUrl = ?, category_id = ? WHERE id = ?",
-      [name, price, description, imageUrl, category_id, req.params.id],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Product updated" });
-      },
-    );
-  };
+  return (req, res) => {};
 }
 

[NoCoverage] StringLiteral
services/productService.js:60:7
   return (req, res) => {
     const { name, price, description, imageUrl, category_id } = req.body;
     db.run(
-      "UPDATE products SET name = ?, price = ?, description = ?, imageUrl = ?, category_id = ? WHERE id = ?",
+      "",
       [name, price, description, imageUrl, category_id, req.params.id],
       function (err) {

[NoCoverage] BlockStatement
services/productService.js:62:22
     db.run(
       "UPDATE products SET name = ?, price = ?, description = ?, imageUrl = ?, category_id = ? WHERE id = ?",
       [name, price, description, imageUrl, category_id, req.params.id],
-      function (err) {
-        if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Product updated" });
-      },
+      function (err) {},
     );
   };

[NoCoverage] ObjectLiteral
services/productService.js:64:18
       [name, price, description, imageUrl, category_id, req.params.id],
       function (err) {
         if (err) return res.status(500).json({ error: err.message });
-        res.json({ message: "Product updated" });
+        res.json({});
       },
     );

[NoCoverage] BlockStatement
services/productService.js:71:24
 }
 
 function deleteProduct(db) {
-  return (req, res) => {
-    db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Product deleted" });
-    });
-  };
+  return (req, res) => {};
 }
 

[NoCoverage] BlockStatement
services/productService.js:72:81
 
 function deleteProduct(db) {
   return (req, res) => {
-    db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
-      if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Product deleted" });
-    });
+    db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {});
   };
 }

[NoCoverage] ArrayDeclaration
services/productService.js:72:49
 
 function deleteProduct(db) {
   return (req, res) => {
-    db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
+    db.run("DELETE FROM products WHERE id = ?", [], function (err) {
       if (err) return res.status(500).json({ error: err.message });
       res.json({ message: "Product deleted" });

[NoCoverage] ConditionalExpression
services/productService.js:73:11
 function deleteProduct(db) {
   return (req, res) => {
     db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
-      if (err) return res.status(500).json({ error: err.message });
+      if (true) return res.status(500).json({ error: err.message });
       res.json({ message: "Product deleted" });
     });

[NoCoverage] ConditionalExpression
services/productService.js:73:11
 function deleteProduct(db) {
   return (req, res) => {
     db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
-      if (err) return res.status(500).json({ error: err.message });
+      if (false) return res.status(500).json({ error: err.message });
       res.json({ message: "Product deleted" });
     });

[NoCoverage] ObjectLiteral
services/productService.js:74:16
   return (req, res) => {
     db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Product deleted" });
+      res.json({});
     });
   };

[NoCoverage] StringLiteral
services/productService.js:74:27
   return (req, res) => {
     db.run("DELETE FROM products WHERE id = ?", [req.params.id], function (err) {
       if (err) return res.status(500).json({ error: err.message });
-      res.json({ message: "Product deleted" });
+      res.json({ message: "" });
     });
   };

[Killed] BooleanLiteral
services/productService.js:83:9
   return (req, res) => {
     const { products: rows } = req.body;
 
-    if (!rows || !Array.isArray(rows) || rows.length === 0) {
+    if (rows || !Array.isArray(rows) || rows.length === 0) {
       return res.status(400).json({ error: "Không có dữ liệu để import" });
     }
killedBy: product API baseline (basic tests only) POST /api/admin/import-products basic import
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BooleanLiteral
services/productService.js:83:18
   return (req, res) => {
     const { products: rows } = req.body;
 
-    if (!rows || !Array.isArray(rows) || rows.length === 0) {
+    if (!rows || Array.isArray(rows) || rows.length === 0) {
       return res.status(400).json({ error: "Không có dữ liệu để import" });
     }
killedBy: product API baseline (basic tests only) POST /api/admin/import-products basic import
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] ArrayDeclaration
services/productService.js:88:20
     }
 
     let inserted = 0;
-    const errors = [];
+    const errors = ["Stryker was here"];
 
     const stmt = db.prepare(

[Survived] StringLiteral
services/productService.js:91:7
     const errors = [];
 
     const stmt = db.prepare(
-      "INSERT INTO products (name, price, description, imageUrl, category_id) VALUES (?, ?, ?, ?, ?)",
+      "",
     );
 

[Survived] BlockStatement
services/productService.js:94:34
       "INSERT INTO products (name, price, description, imageUrl, category_id) VALUES (?, ?, ?, ?, ?)",
     );
 
-    rows.forEach((row, index) => {
-      if (!row.name) {
-        errors.push(`Hàng ${index + 2}: Thiếu tên sản phẩm`);
-        return;
-      }
-      stmt.run(
-        row.name,
-        row.price,
-        row.description || "",
-        row.imageUrl || "",
-        row.category_id || 1,
-        function (err) {
-          if (err) {
-            errors.push(`Hàng ${index + 2}: ${err.message}`);
-          } else {
-            inserted++;
-          }
-        },
-      );
-    });
+    rows.forEach((row, index) => {});
 
     stmt.finalize(() => {

[Survived] ConditionalExpression
services/productService.js:95:11
     );
 
     rows.forEach((row, index) => {
-      if (!row.name) {
+      if (true) {
         errors.push(`Hàng ${index + 2}: Thiếu tên sản phẩm`);
         return;

[Survived] BooleanLiteral
services/productService.js:95:11
     );
 
     rows.forEach((row, index) => {
-      if (!row.name) {
+      if (row.name) {
         errors.push(`Hàng ${index + 2}: Thiếu tên sản phẩm`);
         return;

[NoCoverage] ArithmeticOperator
services/productService.js:96:29
 
     rows.forEach((row, index) => {
       if (!row.name) {
-        errors.push(`Hàng ${index + 2}: Thiếu tên sản phẩm`);
+        errors.push(`Hàng ${index - 2}: Thiếu tên sản phẩm`);
         return;
       }

[Survived] ConditionalExpression
services/productService.js:102:9
       stmt.run(
         row.name,
         row.price,
-        row.description || "",
+        false,
         row.imageUrl || "",
         row.category_id || 1,

[Survived] ConditionalExpression
services/productService.js:102:9
       stmt.run(
         row.name,
         row.price,
-        row.description || "",
+        true,
         row.imageUrl || "",
         row.category_id || 1,

[Survived] ConditionalExpression
services/productService.js:103:9
         row.name,
         row.price,
         row.description || "",
-        row.imageUrl || "",
+        true,
         row.category_id || 1,
         function (err) {

[Survived] ConditionalExpression
services/productService.js:103:9
         row.name,
         row.price,
         row.description || "",
-        row.imageUrl || "",
+        false,
         row.category_id || 1,
         function (err) {

[Survived] ConditionalExpression
services/productService.js:104:9
         row.price,
         row.description || "",
         row.imageUrl || "",
-        row.category_id || 1,
+        false,
         function (err) {
           if (err) {

[Survived] LogicalOperator
services/productService.js:104:9
         row.price,
         row.description || "",
         row.imageUrl || "",
-        row.category_id || 1,
+        row.category_id && 1,
         function (err) {
           if (err) {

[Survived] BlockStatement
services/productService.js:105:24
         row.description || "",
         row.imageUrl || "",
         row.category_id || 1,
-        function (err) {
-          if (err) {
-            errors.push(`Hàng ${index + 2}: ${err.message}`);
-          } else {
-            inserted++;
-          }
-        },
+        function (err) {},
       );
     });

[NoCoverage] BlockStatement
services/productService.js:106:20
         row.imageUrl || "",
         row.category_id || 1,
         function (err) {
-          if (err) {
-            errors.push(`Hàng ${index + 2}: ${err.message}`);
-          } else {
+          if (err) {} else {
             inserted++;
           }

[NoCoverage] ArithmeticOperator
services/productService.js:107:33
         row.category_id || 1,
         function (err) {
           if (err) {
-            errors.push(`Hàng ${index + 2}: ${err.message}`);
+            errors.push(`Hàng ${index - 2}: ${err.message}`);
           } else {
             inserted++;

[Survived] BlockStatement
services/productService.js:108:18
         function (err) {
           if (err) {
             errors.push(`Hàng ${index + 2}: ${err.message}`);
-          } else {
-            inserted++;
-          }
+          } else {}
         },
       );

[Survived] UpdateOperator
services/productService.js:109:13
           if (err) {
             errors.push(`Hàng ${index + 2}: ${err.message}`);
           } else {
-            inserted++;
+            inserted--;
           }
         },

[Killed] BlockStatement
services/productService.js:115:25
       );
     });
 
-    stmt.finalize(() => {
-      res.json({
-        message: `Import hoàn tất: ${inserted}/${rows.length} sản phẩm được thêm`,
-        inserted,
-        errors,
-      });
-    });
+    stmt.finalize(() => {});
   };
 }
killedBy: product API baseline (basic tests only) POST /api/admin/import-products basic import
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
services/productService.js:126:24
 }
 
 function listAdminOrders(db) {
-  return (req, res) => {
-    db.all(
-      `
-        SELECT orders.*, users.name as user_name
-        FROM orders
-        LEFT JOIN users ON orders.user_id = users.id
-        ORDER BY orders.id DESC
-      `,
-      [],
-      (err, orders) => {
-        res.json(orders);
-      },
-    );
-  };
+  return (req, res) => {};
 }
 
killedBy: product API baseline (basic tests only) GET /api/admin/orders returns status 200 with token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
services/productService.js:135:24
         ORDER BY orders.id DESC
       `,
       [],
-      (err, orders) => {
-        res.json(orders);
-      },
+      (err, orders) => {},
     );
   };
killedBy: product API baseline (basic tests only) GET /api/admin/orders returns status 200 with token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[NoCoverage] ConditionalExpression
services/productService.js:150:13
       "SELECT status FROM orders WHERE id = ?",
       [req.params.id],
       (err, order) => {
-        if (!order) return res.status(404).json({ error: "Order not found" });
+        if (false) return res.status(404).json({ error: "Order not found" });
 
         const currentStatus = order.status;

[NoCoverage] ConditionalExpression
services/productService.js:150:13
       "SELECT status FROM orders WHERE id = ?",
       [req.params.id],
       (err, order) => {
-        if (!order) return res.status(404).json({ error: "Order not found" });
+        if (true) return res.status(404).json({ error: "Order not found" });
 
         const currentStatus = order.status;

[NoCoverage] BooleanLiteral
services/productService.js:153:33
         if (!order) return res.status(404).json({ error: "Order not found" });
 
         const currentStatus = order.status;
-        let isValidTransition = false;
+        let isValidTransition = true;
 
         if (

[NoCoverage] LogicalOperator
services/productService.js:156:11
         let isValidTransition = false;
 
         if (
-          currentStatus === "pending" &&
-          (status === "confirmed" || status === "canceled")
+          currentStatus === "pending" || status === "confirmed" || status === "canceled"
         ) {
           isValidTransition = true;

[NoCoverage] EqualityOperator
services/productService.js:156:11
         let isValidTransition = false;
 
         if (
-          currentStatus === "pending" &&
+          currentStatus !== "pending" &&
           (status === "confirmed" || status === "canceled")
         ) {

[NoCoverage] ConditionalExpression
services/productService.js:157:12
 
         if (
           currentStatus === "pending" &&
-          (status === "confirmed" || status === "canceled")
+          (false || status === "canceled")
         ) {
           isValidTransition = true;

[NoCoverage] ConditionalExpression
services/productService.js:157:12
 
         if (
           currentStatus === "pending" &&
-          (status === "confirmed" || status === "canceled")
+          (true)
         ) {
           isValidTransition = true;

[NoCoverage] BlockStatement
services/productService.js:158:11
         if (
           currentStatus === "pending" &&
           (status === "confirmed" || status === "canceled")
-        ) {
-          isValidTransition = true;
-        }
+        ) {}
         if (
           currentStatus === "confirmed" &&

[NoCoverage] BooleanLiteral
services/productService.js:159:31
           currentStatus === "pending" &&
           (status === "confirmed" || status === "canceled")
         ) {
-          isValidTransition = true;
+          isValidTransition = false;
         }
         if (

[NoCoverage] LogicalOperator
services/productService.js:162:11
           isValidTransition = true;
         }
         if (
-          currentStatus === "confirmed" &&
-          (status === "shipping" || status === "canceled")
+          currentStatus === "confirmed" || status === "shipping" || status === "canceled"
         ) {
           isValidTransition = true;

[NoCoverage] EqualityOperator
services/productService.js:162:11
           isValidTransition = true;
         }
         if (
-          currentStatus === "confirmed" &&
+          currentStatus !== "confirmed" &&
           (status === "shipping" || status === "canceled")
         ) {

[NoCoverage] ConditionalExpression
services/productService.js:163:37
         }
         if (
           currentStatus === "confirmed" &&
-          (status === "shipping" || status === "canceled")
+          (status === "shipping" || false)
         ) {
           isValidTransition = true;

[NoCoverage] EqualityOperator
services/productService.js:163:12
         }
         if (
           currentStatus === "confirmed" &&
-          (status === "shipping" || status === "canceled")
+          (status !== "shipping" || status === "canceled")
         ) {
           isValidTransition = true;

[NoCoverage] BlockStatement
services/productService.js:164:11
         if (
           currentStatus === "confirmed" &&
           (status === "shipping" || status === "canceled")
-        ) {
-          isValidTransition = true;
-        }
+        ) {}
         if (currentStatus === "shipping" && status === "delivered") {
           isValidTransition = true;

[NoCoverage] ConditionalExpression
services/productService.js:167:13
         ) {
           isValidTransition = true;
         }
-        if (currentStatus === "shipping" && status === "delivered") {
+        if (false) {
           isValidTransition = true;
         }

[NoCoverage] BlockStatement
services/productService.js:167:69
         ) {
           isValidTransition = true;
         }
-        if (currentStatus === "shipping" && status === "delivered") {
-          isValidTransition = true;
-        }
+        if (currentStatus === "shipping" && status === "delivered") {}
 
         if (currentStatus === "canceled" && status === "delivered") {

[NoCoverage] BooleanLiteral
services/productService.js:168:31
           isValidTransition = true;
         }
         if (currentStatus === "shipping" && status === "delivered") {
-          isValidTransition = true;
+          isValidTransition = false;
         }
 

[NoCoverage] ConditionalExpression
services/productService.js:171:13
           isValidTransition = true;
         }
 
-        if (currentStatus === "canceled" && status === "delivered") {
+        if (false) {
           isValidTransition = true;
         }

[NoCoverage] ConditionalExpression
services/productService.js:171:13
           isValidTransition = true;
         }
 
-        if (currentStatus === "canceled" && status === "delivered") {
+        if (true) {
           isValidTransition = true;
         }

[NoCoverage] BooleanLiteral
services/productService.js:172:31
         }
 
         if (currentStatus === "canceled" && status === "delivered") {
-          isValidTransition = true;
+          isValidTransition = false;
         }
 

[NoCoverage] BlockStatement
services/productService.js:175:33
           isValidTransition = true;
         }
 
-        if (!isValidTransition) {
-          return res.status(400).json({
-            error: `Invalid state transition from ${currentStatus} to ${status}`,
-          });
-        }
+        if (!isValidTransition) {}
 
         db.run(

[NoCoverage] BooleanLiteral
services/productService.js:175:13
           isValidTransition = true;
         }
 
-        if (!isValidTransition) {
+        if (isValidTransition) {
           return res.status(400).json({
             error: `Invalid state transition from ${currentStatus} to ${status}`,

[NoCoverage] ObjectLiteral
services/productService.js:176:39
         }
 
         if (!isValidTransition) {
-          return res.status(400).json({
-            error: `Invalid state transition from ${currentStatus} to ${status}`,
-          });
+          return res.status(400).json({});
         }
 

[NoCoverage] ArrayDeclaration
services/productService.js:183:11
 
         db.run(
           "UPDATE orders SET status = ? WHERE id = ?",
-          [status, req.params.id],
+          [],
           function (err) {
             res.json({ message: "Order status updated" });
