[NoCoverage] BlockStatement
services/productService.js:184:26
         db.run(
           "UPDATE orders SET status = ? WHERE id = ?",
           [status, req.params.id],
-          function (err) {
-            res.json({ message: "Order status updated" });
-          },
+          function (err) {},
         );
       },
